#include<stdio.h>
#include<locale.h>
#include<iostream>
#include<time.h>

using namespace std;

void main()
{
	setlocale(LC_ALL, "rus");
	srand(time(NULL));

	int x;
	cout << "" << endl;
	cin >> x;

	if (x == 1) {
	//*Написать, программу, которая вычисляет прибыль фирмы за 6 месяцев.Пользователь вводит прибыль фирмы за каждый месяц.

		int x[6], sum=0;

		for (int i = 0; i < 6; i++) {
			cout << "Vvedite pribil :" << endl;
			cin >> x[i];
			sum += x[i];
		}

		cout << sum << " Sum za 6 m." << endl;

		
	}

	else if (x == 2) {
	//*Написать программу, которая выводит одномерный массив в обратном порядке
		int x[6];

		for (int i = 0; i < 6; i++) {
			x[i] = 1 + rand() % 99;
			cout << x[i] << endl;
		}
		cout << "<-------------->" << endl;

		for (int i = 5; i >= 0; i--) {
			cout << x[i] << endl;
		
		}
	}

	else if (x == 3) {
//*Пользователь вводит длину сторон пятиугольника, каждая сторона заноситься в массив, необходимо вычислить периметр пятиугольника(периметр – сумма всех сторон).
		
			int x[5],sum=0;

		for (int i = 0; i < 5; i++) {
			cout << "Vvedite storony:" << endl;
			cin >> x[i];
			sum += x[i];
		}
		cout << sum << "Perimetr " << endl;
	}

	else if (x == 4) {
	//*Пользователь вводит прибыль фирмы за год(12 месяцев).Необходимо определить месяц, в котором прибыль была максимальна и месяц, в котором прибыль была минимальна.
		int x[12],min=100,max=0,a,b;

		for (int i = 0; i < 12; i++) {
			cout << "Vvedite pr: " << endl;
			cin >> x[i];
			if (x[i] < min) {
				min = x[i];
				a = i;
			}
			if (x[i] > max) {
				max = x[i];
				b = i;
			}
		}

		cout << a << "mesyas = " << min << endl;
		cout << b << "mesyas = " << max << endl;
		
	}

	else if (x == 5) {
//*В одномерном массиве, заполненном случайными числами, определить минимальный и максимальный элементы
		int x[12], min = 100, max = 0, a, b;

		for (int i = 0; i < 12; i++) {
			x[i] = 1 + rand() % 99;
			cout << i << ") " << x[i] << endl;
			if (x[i] < min) {
				min = x[i];
				a = i;
			}
			if (x[i] > max) {
				max = x[i];
				b = i;
			}
		}

		cout << a << "mesyas = " << min << endl;
		cout << b << "mesyas = " << max << endl;

	}

	else if (x == 6) {
	//Пользователь вводит прибыль фирмы за год(12 месяцев).Затем  пользователь вводит диапазон(например, 3 и 6 – поиск между 3 - м и 6 - м месяцем).
	//Необходимо определить месяц, в котором прибыль была максимальна и месяц, в котором прибыль была минимальна с учетом выбранного диапазона.
	
		int x[12], b, a, max = 0,min=100,a1,b1;

		for (int i = 0; i < 12; i++) {
			x[i] = 1 + rand() % 99;
			cout <<i<<") "<< x[i] << endl;
		}
	
		cout << "Vvedite diapazon: " << endl;
		cin >> a;
		cin >> b;

		for (int i = a; i <= b; i++) {
			if (x[i] < min) {
				min = x[i];
				a1 = i;
			}
			if (x[i] > max) {
				max = x[i];
				b1 = i;			
			}
		}

		cout << a1 << " Pr min" << min << endl;
		cout << b1 << " Pr max" << max << endl;
	}

	else if (x == 7) {
		/*В одномерном массиве, состоящем из N вещественных чисел вычислить :
		•	Сумму отрицательных элементов.
			•	Произведение элементов, находящихся между min и max элементами.
			•	Произведение элементов с четными номерами.
			•	Сумму  элементов, находящихся между первым и последним отрицательными элементами.*/
		

	}

	else if (x == 8) {
//**Сжать(сдвинуть элементы) массив, удалив из него все 0, и заполнить освободившиеся справа элементы значениями - 1;
		int x[10];

		for (int i = 0; i < 10; i++) {
			x[i] = 0 + rand() % 5;
			cout << x[i] << " \t";
		}

		for (int i = 0; i < 10; i++) {
			if (x[i] == 0) {
				

			}

		}



	}

	else if (x == 9) {
	//*Написать программу, выполняющую сортировку одномерного массива целых чисел методом пузырька.
	
		int x[10],c;

		for (int i = 0; i < 10; i++) {
			x[i] = 1 + rand() % 99;
		}

		for (int i = 0; i < 9; i++) {
			for (int j = 9; j > i; j--) {
				if (x[j - 1]>x[j]) {
					c = x[j-1];
					x[j - 1] = x[j];
					x[j] = c;
				}
			}
		}

		for (int i = 0; i < 10; i++) {
			cout << x[i] << endl;
		}
	}

	else if (x == 10) {
		/*Написать программу «справочник».Создать два одномерных массива.Один массив хранит номера ICQ, второй – телефонные номера.Реализовать меню для пользователя :
		a)	отсортировать по номерам ICQ
		b)	отсортировать по номерам телефона
		c)	вывести список пользователей
		d)	выход*/

		int x[10], y[10],c;

		for (int i = 0; i < 10; i++) {
			x[i] = 154856321 + rand() % 148623;
		}
		cout << "<---->" << endl;
		for (int j = 0; j < 10; j++) {
			y[j] = 235060 + rand() % 2254150;
					}

		for (int i = 0; i < 9; i++) {
			for (int j = 9; j > i; j--) {
				if (x[j - 1]>x[j]) {
					c = x[j - 1];
					x[j - 1] = x[j];
					x[j] = c;
				}
			}
		}

		for (int i = 0; i < 9; i++) {
			for (int j = 9; j > i; j--) {
				if (y[j - 1]>y[j]) {
					c = y[j - 1];
					y[j - 1] = y[j];
				y[j] = c;
				}
			}
		}

		cout << "Выберите действие: " << endl;
		cout << "1) Отсортировать по номерам ICQ" << endl;
		cout << "2) Отсортировать по номерам телефона" << endl;
		cout << "3) Вывести список пользователей" << endl;
		cout << "4) Выход" << endl;
		cin >> c;

		if (c == 1) {
			for (int i = 0; i < 10; i++) {
				cout << x[i] << endl;
			}
		}

		else if (c == 2) {
			for (int i = 0; i < 10; i++) {
				cout <<"8 707 "<< y[i] << endl;
			}
		}

		else if (c == 3) {
			cout << "Пользователей нет!!!" << endl;
		}

		else if (c == 4) {
			cout << " GGWP " << endl;
		}
	}

	else if (x == 11) {
		/*Написать программу «успеваемость».Пользователь вводит 10 оценок студента.Реализовать меню для пользователя
			a)	вывод оценок(вывод содержимого массива)
			b)	пересдача экзамена(пользователь вводит номер элемента массива и новую оценку)
			c)	выходит ли стипендия(стипендия выходит, если средний бал не ниже 10.7)*/

		int x[10];
		float sr=0;

		for (int i = 0; i < 10; i++)
		{
			cout << "Vvedite osenky: " << endl;
			cin >> x[i];
		}

		for (int i = 0; i < 10; i++)
		{
			cout <<i<<") "<< x[i] << " \t";
			sr += x[i];
		}

		int y;
		cout << "Viberite deistvie: " << endl;
		cout << "1) Вывод оценок" << endl;
		cout << "2) Пересдача экзамена" << endl;
		cout << "3) Выходит ли стипендия" << endl;
		cin >> y;

		if (y == 1) {
			for (int i = 0; i < 10; i++) {
				cout << x[i] << endl;
			}
		
		}

		else if (y == 2) {

			cout << "Введите индекс: " << endl;
			int u,a;
			cin >> u;
			cout << "Введите новую оценку: " << endl;
			cin >> a;
			for (int i = 0; i < 10; i++) {
				x[u] = a;
			}
			for (int i = 0; i < 10; i++)
			{
				cout << i << ") " << x[i] << " \t";
			}
		}

		else if (y == 3) {
			sr = sr / 10;

			if (sr > 10.7) {
				cout << "Стипендия есть!" << endl;
			}
			else { cout << "Стипендий нет!" << endl; }
		}

	
	}

	else if (x == 12) {
		//Написать программу, которая осуществляет разбиение введенного числа на цифры и 
		//заносит эти цифры в массив.Вывести элементы массива, разделяя их двумя пробелами.
		int x;
		cout << "" << endl;
		cin >> x;

		if (x < 100) {
			int q[2],a,b;
			a = x % 10;
			b = x / 10;
			q[0] = b; q[1] = a;
			for (int i = 0; i < 2; i++) {
				cout << q[i] << "  ";
			}
		}

		else if (x < 1000) {
			int q[3], a, b,c;
			a = x / 100;
			b = x % 100%10;
			c = (x / 10) % 10;
			q[0] = a; q[1] = c; q[2] = b;
			for (int i = 0; i < 3; i++) {
				cout << q[i] << "  ";
			}
		}

		else if (x < 10000) {
			int q[4], a, b, c,d;
			a = x / 1000;
			b = x % 1000 % 100%10;
			c = (x / 100) % 10;
			d = x/10%100%10;
				q[0] = a; q[1] = c; q[2] = d; q[3] = b;
			for (int i = 0; i < 4; i++) {
				cout << q[i] << "  ";
			}
		}

		else if (x < 100000) {
			int q[5], a, b, c, d,h;
			a = x / 1000/10;
			b = x % 1000 % 100 % 10;
			c = (x / 100) % 10;
			d = x / 10 % 100 % 10;
			h = x / 1000 % 10;
			q[0] = a; q[1] = h; q[2] = c; q[3] = d; q[4] = b;
			for (int i = 0; i < 5; i++) {
				cout << q[i] << "  ";
			}
		
		}

		else if (x < 1000000) {
			int q[6], a, b, c, d, h,g;
			a = x / 1000 / 10/10;
			g = x / 1000 / 10 % 10;
			h = x / 1000 % 10;
			c = (x / 100) % 10;
			d = x / 10 % 100 % 10;
			b = x % 1000 % 100 % 10;			
			q[0] = a; q[1] = g; q[2] = h; q[3] = c; q[4] = d; q[5] = b;
			for (int i = 0; i < 6; i++) {
				cout << q[i] << "  ";
			}
		
		}

		else if (x < 10000000) {
			int q[7], a, b, c, d, h, g,k;
			a = x / 1000 / 10 / 10/10;
			g = x / 1000 / 10 % 10;
			h = x / 1000 % 10;
			c = (x / 100) % 10;
			d = x / 10 % 100 % 10;
			b = x % 1000 % 100 % 10;
			k = x / 1000 / 10 / 10 % 10;
			q[0] = a; q[2] = g; q[3] = h; q[4] = c; q[5] = d; q[6] = b; q[1] = k;
			for (int i = 0; i < 7; i++) {
				cout << q[i] << "  ";
			}
		
		}
	}

	else if (x == 13) {
		//29.	*В двухмерном массиве целых числе посчитать :
		//a)	сумму всех элементов массива
		//b)	среднее арифметическое всех элементов массива
		//c)	минимальный элемент
		//d)	максимальный элемент

		int x[5][5], sum=0, min=100,max=0;

		for (int i = 0; i < 5; i++) {
			for (int j = 0; j < 5; j++) {
				x[i][j] = 1 + rand() % 99;
				sum += x[i][j];
				if (x[i][j] > max) {
					max = x[i][j];
				}
				if (x[i][j] < min) {
					min = x[i][j];
				}
				cout << x[i][j] << " \t";
			}cout << endl;
		}
		float sr = sum / 25;
		cout << "суммa всех элементов массива " << sum << endl;
		cout << "среднее арифметическое всех элементов массива " << sr << endl;
		cout << "минимальный элемент " << min << endl;
		cout << "максимальный элемент " << max << endl;
	}

	else if (x == 14) {
		/*30.	**В двухмерном массиве целых чисел посчитать сумму элементов :
		a)	в каждой строке
		b)	в каждом столбце
		c)	*** одновременно по всем строкам и всем столбцам.Оформить следующим образом :
		3   5   6   7 | 21
		12  1   1   1 | 15
		0   7   12  1 | 20
		-------------------- -
		15  13  19  9 | 56*/
		int x[5][5],sum,sum1=0,q[5],sum2=0;
		for (int i = 0; i < 5; i++) {
			for (int j = 0; j < 5; j++) {
				x[i][j] = 1 + rand() % 99;
				cout << x[i][j] << " \t";				
				}
				cout << endl;
			}

		for (int i = 0; i < 5; i++) {
			sum = 0;
			for (int j = 0; j < 5; j++) {
				sum += x[i][j];
			}
			cout << i+1 << ") строка = " << sum << endl;
		}

		for (int i = 0; i < 5; i++) {
			sum = 0;
			for (int j = 0; j < 5; j++) {
				sum += x[j][i];
			}
			cout << i+1 << ") столбец = " << sum << endl;
		}

		for (int i = 0; i < 5; i++) {
			sum = 0;
			sum1 = 0;
			for (int j = 0; j < 5; j++) {
				sum += x[j][i];
				sum1 += x[i][j];
				cout << x[i][j] << " \t";
			}
			cout <<"|" <<" \t" ;
			cout << sum1 <<" \t";
			cout << endl;
			q[i] = sum;
			
		}
cout << "--------------------------------------------" << endl;
		for (int i = 0; i < 5; i++) {
			
			cout << q[i] << " \t";
			sum2 += q[i];
			
		}cout << "|" << " \t";
			cout << sum2 << " \t";
	}

	}

